from math import cos, sin

angle = float(input("Введите значение угла в радианах: "))

print("Результаты функций:")
print(1 - 0.25 * sin(2 * angle) ** 2 + cos(2 * angle))
print(cos(angle) ** 2 + cos(angle) ** 4)


# 1. Переименовать репозиторий проекта в соответствии с соглашением об именовании - репозиторий проекта
# и папка проекта должны иметь имя вида "BMSTU_Python_ФамилияИО" (ФамилияИО должно быть указано
# в латинской транскрипции).
# 2. Оформить и разместить в папке отчет о выполнении лабораторной работы в соответствии с шаблоном отчета
# о лабораторной работе (см. файл template_laboratory_report_00.ott) и методическими указаниями в нем.
# 3. Ограничить импортируемые функции только теми, что указаны в тексте программы.
# 4. Исправить текст программы в соответствии с требованиями Руководства по стилю кода Python
# (https://peps.python.org/pep-0008/).

